app/controllers/admin_controller.rb

  def index
    @user = User.all.count
    @log= Log.all.count
---
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "logs"