app/controllers/company_profiles_controller.rb

  def create
    @company_profile = CompanyProfile.new(company_profile_params)
    @company_profile.userid = current_user.id
    if @company_profile.save then
---
INSERT INTO "company_profiles" ("name", "address", "vdc_mun", "phone", "vat_pan_no", "logo", "district", "zone", "email", "website", "userid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def edit
    @company_profile = CompanyProfile.find(params[:id])
---
SELECT  "company_profiles".* FROM "company_profiles" WHERE "company_profiles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @company_profile = CompanyProfile.find(params[:id])
    @msg = @company_profile.name + " company has been updated."
    if @company_profile.update(company_profile_params)
---
SELECT  "company_profiles".* FROM "company_profiles" WHERE "company_profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "company_profiles" SET "name" = $1, "vdc_mun" = $2, "updated_at" = $3 WHERE "company_profiles"."id" = $4  [["name", "shital babu"], ["vdc_mun", ""], ["updated_at", 2017-02-11 14:23:49 UTC], ["id", 2]]

  def index
    @perpage = 2
    @company_id = CompanyProfile.where(userid: current_user.id)
    @company_id.ids.each do |f|
      @a = f
    end
    if @a.nil?
      @company_profile = nil
    else
      @company_profile = CompanyProfile.where(id: @a)
      @company_profile = @company_profile.paginate(:page => params[:page], :per_page => @perpage)
---
SELECT "company_profiles"."id" FROM "company_profiles" WHERE "company_profiles"."user_id" = $1  [["user_id", 22]]
SELECT  "company_profiles".* FROM "company_profiles" WHERE "company_profiles"."id" = $1 LIMIT $2 OFFSET $3  [["id", 2], ["LIMIT", 2], ["OFFSET", 0]]

  def destroy
    @company_profile = CompanyProfile.destroy(params[:id])
---
DELETE FROM "company_profiles" WHERE "company_profiles"."id" = $1  [["id", 2]]