app/controllers/logs_controller.rb

SELECT  "logs".* FROM "logs" LIMIT $1 OFFSET $2  [["LIMIT", 50], ["OFFSET", 0]]
---
  def index
    @perpage = 50
    @logs =  Log.paginate(:page => params[:page], :per_page => @perpage)