app/controllers/users_controller.rb

  def index
    @perpage = 10
    @users = User.where(deleted_at: nil) #to discard current user and filter the pagination
    @users = @users.where.not(id: current_user.id)
    @users = @users.paginate(:page => params[:page], :per_page => @perpage).order('first_name ASC')
---
SELECT  "users".* FROM "users" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT  "users".* FROM "users" WHERE ("users"."id" != $1) AND ("users"."order" != $2) LIMIT $3 OFFSET $4  [["id", 22], ["order", "first_name  ASC"], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def destroy
    @user = User.find(params[:id])
    if @user.deleted_at.nil?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 31], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 35]]